{
  "rules": [
    {
      "id": 1,
      "titles": [],
      "descriptions": []
    },
    {
      "id": 2,
      "titles": ["All posts must make an attempt at humor.", "No memes, and no HIFW, MRW, MeIRL, or DAE posts.",
      "No reposts.", "No personal info, no hate speech, no harassment.", "No politics.", "No forbidden titles.", 
      "No gore, pornography, or sexually graphic images.", "Do not rehost or hotlink webcomics.", 
      "No pictures of just text.", "No SMS or social media content (including Reddit)."],
      "descriptions": ["Humor is subjective, but all posts must at least make an attempt at humor. As the minimum age for Reddit access is 13 years old, posts which are intentionally disruptive, inane, or nonsensical will be removed.",
      "If your submission begins with \"When you…\" or \"When they…\" or anything of a similar nature, it is not allowed here. Submissions depicting or containing intentionally emulated behaviors (memes) are also not allowed, including memetic image macros, \"challenges,\" or elements thereof. Non-memetic image macros are allowed.",
      "Reposts will be removed at the moderators’ discretion. Serial reposters will be banned. Please use KarmaDecay to determine if something has been submitted here before.",
      "No identifying information, including anything hosted on platforms making that information public. Posts encouraging the harassment of any individual, group, community, or subreddit will be removed, and the submitting user may be banned. If necessary, a report will be made to the site administration. In accordance with Reddit's policies, there is zero tolerance for this.",
      "Anything involving politics or a political figure (regardless of context) will be removed.\n\nTry /r/politicalhumor instead.",
      "No asking for upvotes (in any form), no “Cake Day” posts, and no posts to communicate with another Redditor. Posts with titles such as \"I got banned from /r/___\" or \"This got removed from /r/___\" are not allowed. Emoji-based titles, memetic titles, and titles meant to circumvent any other rules are also forbidden.",
      "Try /r/NSFWfunny. All other NSFW content must be tagged as such.", "If you are not the author of the comic in question, you may only submit links to the page where it is hosted. Webcomic authors may request verification from the moderators, after which they may rehost their own work.",
      "Submissions in which the humor can be conveyed via text alone are not allowed. This includes pictures of text with irrelevant images that don't add context, and transcriptions of standup comedy (as with /r/standupshots). Make a self post instead.",
      "Social media content of any kind is not allowed. This includes anything from Reddit, Twitter, Tumblr, Facebook, YouTube, or any other form of \"comments section\" on the Internet, as well as images accompanied by text from those platforms. Images with SnapChat text added are allowed, as long as all UI elements have been removed.\n\nPlease view our wiki for suggestions of where these submissions can be offered."]
    },
    {
      "id": 3,
      "titles": ["Rule 1 - Questions must be clear and direct and may not use the body textbox", "Rule 2 - No personal or professional advice requests",
      "Rule 3 - Open ended questions only", "Rule 4 - No personal info", "Rule 5 - No loaded questions", "Rule 6 - [Serious] tagged posts are off-limits to jokes or irrelevant replies",
      "Rule 7 - No begging for goods or services, or Reddit rewards", "Rule 8 - Be respectful to other users at all times and conduct your behaviour in a civil manner",
      "Rule 9 - No image only replies or large ascii art", "Comments in [Serious] posts must be on topic"],
      "descriptions": ["All questions must be clear, written in English, and conclude with a question mark\nAll context in the title must be necessary to understanding the question; do not give “example answers” in the post title (i.e. “Other than your mom, ______?”)\nNo text in the text box - any additional info from you must be added as a comment to your post",
      "Askreddit is NOT your personal or professional advice platform\nDo not makes posts asking for professional advice - medical, legal, financial, or otherwise\nAll posts asking for advice must be generic and not specific to your situation alone\nDo not use personal pronouns\nNo crowdsourcing naming or purchasing decisions",
      "Post must be an open-ended discussion question\nTitle must not be phrased to allow a simple yes/no answer\nNo questions that have definite answers\nQuestion must not be a poll or survey\nNo “Either/Or” type questions\nDo not ask for NSFW links\nDo not specify a length (eg \"in three words...\") or make your post into a game",
      "Do not post or seek any real or fake personal information (examples include: full names, phone numbers, email addresses, or social media accounts)\nOnly link another user's comment when it is relevant and never when it is to launch a personal attack or encourage others to do so\nDo not ask questions designed to target specific usernames or links to social media",
      "Do not include an opinion, bias, or lead respondents towards expressing a specific opinion in your post title\nDo not use this subreddit to promote a specific agenda or to gain positive or negative publicity for an entity or person",
      "[Serious] posts are off-limits for joke replies and irrelevant or off-topic comments and discussion\nIf the OP asks for answers from a specific group in a [Serious] post, top level comments must be made from members of that group\nPosts that do not receive relevant answers within an hour will be removed",
      "Do not ask for Reddit rewards, money, goods, services,or favors\nDo not form a brigade to draw positive or negative attention to posts or comments in AskReddit, even from other subreddits",
      "Do not make personal attacks, insult, or demean a specific group or person\nDo not use slurs without relevant context and quotes\nNo blatant statements of bigotry\nNo posts that 'bait' users into breaking other rules\nZero tolerance for posts/comments that sexualize minors\nZero tolerance for posts/comments that encourage suicide\nDo not spam or make attempts to farm karma",
      "Comment replies must consist of more than just an image or link\nNo ASCII/emoji images over one line",
      "Comments made in posts tagged [serious] may not contain jokes or off topic remarks"]
    }
  ]
}
  
 